app/controllers/search_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE'%search_text%')
SELECT "users".* FROM "users" WHERE (name LIKE'%花ちゃん%')
---
  def search
    search_text = params[:search_text]
    @select_model = params[:select_model]
    select_part = params[:select_part]
    @books = Book.search(search_text,@select_model,select_part)
    @users = User.search(search_text,@select_model,select_part)